# Install essential packages via brew on a mac
# brew bundle --file=~/dotfiles/Brewfile

# Set cask install directory
cask_args appdir: "/Applications"

# Tap other sources for packages
tap 'homebrew/cask'
tap 'homebrew/services'
tap 'heroku/brew'
tap 'thoughtbot/formulae'

brew 'bash'
brew 'git'
brew 'hub'
brew 'tmux'
brew 'reattach-to-user-namespace'

# Languages
brew 'rbenv'
brew 'ruby-build'
brew 'nodenv'
brew 'node-build'
brew 'pyenv'
brew 'pipenv'
brew 'direnv'

# Databases
brew 'postgresql'

brew 'ripgrep'
brew 'tree'
brew 'unrar'
brew 'ack'
brew 'heroku'
brew 'parity'
brew 'unrar'

brew 'ffmpeg'
brew 'youtube-dl'

# Cask app installs
cask 'docker'
cask 'arduino'
