# Install packages via brew on a mac
# brew bundle --file=~/dotfiles/Brewfile

# Tap other sources for packages
tap 'homebrew/versions'
tap 'homebrew/dupes'
tap 'homebrew/homebrew-completions'
tap 'thoughtbot/formulae'

# Install workspace packages
brew 'bash'
brew 'git'
brew 'hub'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'heroku-toolbelt'
brew 'ack'
brew 'the_silver_searcher'
brew 'tree'
brew 'direnv'
brew 'parity'

# Install languages and databases
brew 'node'
brew 'python'
brew 'go'
brew 'postgresql'
brew 'mongodb'
brew 'redis'
brew 'memcached'

# Install development packages
brew 'qt'
brew 'phantomjs'
brew 'imagemagick'

# Install completions
brew 'bash-completion'
brew 'rake-completion'
brew 'bundler-completion'
brew 'gem-completion'
brew 'grunt-completion'

