# Install essential packages via brew on a mac
# brew bundle --file=~/dotfiles/Brewfile

# Set cask install directory
cask_args appdir: "/Applications"

tap 'heroku/brew'
tap 'thoughtbot/formulae'

brew 'bash'
brew 'git'
brew 'heroku'
brew 'hub'
brew 'postgresql'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'tmux'
brew 'tree'

brew 'rbenv'
brew 'nodenv'
brew 'pyenv'

cask 'alfred'
cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'iterm2'
cask 'itsycal'
cask 'slack'
cask 'visual-studio-code'

# tmux, postgresql, ripgrep failed

# Tap other sources for packages
# tap 'homebrew/cask'
# tap 'homebrew/services'

# brew 'ripgrep'

# Languages
# brew 'ruby-build'
# brew 'node-build'
# brew 'pipenv' # not recommended by homebrew anymore
# brew 'direnv'

# Databases
# brew 'unrar'
# brew 'ack'
# brew 'parity'
# brew 'unrar'

# brew 'ffmpeg'
# brew 'youtube-dl'

# Cask app installs
# cask 'docker'
# cask 'arduino'
# cask 'devdocs'
# cask 'lulu'
# cask 'notion'
